On Remote Machine:
James-Yu.latex-workshop
KevinRose.vsc-python-indent
mathematic.vscode-latex
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.makefile-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
oguhpereira.spotify-color-theme
shyykoserhiy.vscode-spotify
tecosaur.latex-utilities
twxs.cmake
valentjn.vscode-ltex
wholroyd.jinja

On Local Machine:
ms-vscode-remote.remote-wsl